[{"question": "What is use of IPAM in MonetX?", "response": "In this module MonetX is fetching data of configured IP on the network devices physical interfaces SVi and Virtual interfaces LIKE  HSRP, VRRP & LB virtual IP. It is also s the interface description, vlan name, subnet, Subnets mask and the status of the physical interface up or down. The benefit of this module is to track any ip from the dashboard & does not need to login to device. in monetX it have capability to add DHCP server as a node and fetch the IP scopes information like Scope name, Lease, used addresses, free addresses etc. and you can manually and  dynamically discover subnets in your environment to get there IP details like where it is configured. Mac address and which ports are open on that IP address and it is also maintaining the ip history with time series if these is MAC change on specific IP it will prompt."}, {"question": "How are top 10 subnet by IP address are displayed on dashboard?", "response": "In the monitoring module MonetX is monitoring all added devices interface so it will show those interface which are highly utilized."}, {"question": "What is TCP open port graph displaying?", "response": "In IPAM module MonetX is scanning through NMAP and getting the data of open TCP ports on specific IP, it is also beneficial for security purpose it will show also the unsecured opened port in your environment"}, {"question": "What is Ip availability summary showing?", "response": "In IPAM dashboard there is widget called Ip availability summary  you can directly go to used and unused IP by just  single click"}, {"question": "What is subnet summary showing?", "response": "In IPAM dashboard there is widget called subnet summary is show how many subnets you manually enter for scanning and how many subnets discovered from devices"}, {"question": "How can I get top 10 subnet by ip address used?", "response": "In IPAM dashboard there is widget called Top 10 subnets by IP used it will show the subnet detail in %"}, {"question": "How can we get ip availability summary of all devices?", "response": "In IPAM dashboard there is widget called Ip availability summary  you can directly go to used and unused IP by just  single click"}, {"question": "How can we get ip availability summary of single device?", "response": "In IPAM dashboard there is widget called Ip availability summary  you can directly go to used and unused IP by just  single click and filter the subnet which you want to check"}, {"question": "How can we get TCP open ports?", "response": "In subnet table ad single ip or complete subnet and click scan button  and check the ports option it will scan the ports on single ip or on complete subnet"}, {"question": "What does discovered from device mean in subnet summary?", "response": "In subnet table the option to discover a subnet from device and scan its DNS resolution, TCP open ports and MAC"}, {"question": "How can I manually add subnet summary?", "response": "Login to MonetX click IPAM click subnet then add subnet with netmask, name and location then click on scan"}, {"question": "What do you mean by DNS not received?", "response": "Once you add the or discovered the subnet in IPAM it will also resolve the IP with FQDN if there is no entry available in DNS server it will show either wise it will not resolved"}, {"question": "What do you mean by DNS received?", "response": "Once you add the or discovered the subnet in IPAM it will also resolve the IP with FQDN if there is entry available in DNS server it will show either wise it will resolved"}, {"question": "What is IPAM?", "response": "In this module MonetX is fetching data of configured IP on the network devices physical interfaces SVi and Virtual interfaces LIKE  HSRP, VRRP & LB virtual IP. It is also s the interface description, vlan name, subnet, Subnets mask and the status of the physical interface up or down. The benefit of this module is to track any ip from the dashboard & does not need to login to device. in monetX it have capability to add DHCP server as a node and fetch the IP scopes information like Scope name, Lease, used addresses, free addresses etc. and you can manually and  dynamically discover subnets in your environment to get there IP details like where it is configured. Mac address and which ports are open on that IP address and it is also maintaining the ip history with time series if these is MAC change on specific IP it will prompt."}, {"question": "How can we export devices in IPAM?", "response": "Bulk import Via Excel Sheet  Click Export Template --- Fill the Excel Sheet ---  Import Excel --- Select devices and click on board --- Devices will be onboarded successfully."}, {"question": "What devices can be added in IPAM?", "response": "While adding device click on device type it will show which type of devices you can onboard on monetX"}, {"question": "What are different sources for adding device?", "response": "adding a Single Device and Bulk import Via Excel Sheet"}, {"question": "How can we add device from atom?", "response": " adding a Single Device Click Atom --- Add Atom --- Fill out the all required details ---  Add password Group --- Done  Select the device ---  click onboard --- Decives will be onboarded successfully."}, {"question": "What is password group when adding a new device?", "response": "Atom --- Password Group --- Add password Group --- fill the details --- Done"}, {"question": "Can we recover deleted device?", "response": "You need to re onboard"}, {"question": "What is MonetX?", "response": "MonetX is a Network automation tool it have different modules like Dynamic inventory MGMT, IPAM, DCCM, RBAC Monitoring"}, {"question": "What's the features of MonetX?", "response": "Dynamic inventory MGMT, IPAM, DCCM, RBAC Monitoring"}, {"question": "Who uses the MonetX?", "response": "MonetX users can be Managers, Admins, Network Engineer, System Engineers and Planning engineers"}, {"question": "Can I customize the menu with my own uses of MonetX?", "response": "It is highly customizable, it can give shape to any idea"}, {"question": "Who are the competitors of MonetX?", "response": "SolarWinds, Manage Engine"}, {"question": "What is  the unique things of MonetX?", "response": "It is highly customizable, Secure, Low Cost, with free Demo installation for 30 days"}, {"question": "What is the requirements of installing the MonetX?", "response": "Inventory To deal with rapid technological advancements, businesses often make changes to their network infrastructure, which can create a lot of problems. Manually tracking and compiling data is a time-consuming process that often leads to overlooking devices, entering data incorrectly, and making compilation errors. Therefore, every business needs a network inventory management tool to organize and manage network configurations. When it comes to managing network devices and organizing network assets to track configurations, a network inventory management software is vital. Let's look at the different components that make up holistic network inventory management system: There 2 methods to add device in MonetX 1: Static one be one & 2: Import excel sheet (Atom) which contains list of devices such as IP address, Location, Rack detail, SW type ETC. Once devices are added in Atom with static information. Tool have button to onboard device this algorithm will communicate will devices over the (SSH, APIs, SMNP) and get dynamic information from the devices like status, Serial No, PN code, patch Version, Manufacturer, vendor and HW version along with this our system have capability to fetch information of  boards, sub Boards and SFPs, like if the there is a stack switch it will show the stack members and all information of each stack member. In sub boards our tool is dynamically fetching information power supplies, fan tray, ethernet and SFP module, supervisor engines and route processors. In SFP our tool is fetching information of each SFP like SFP model, Speed, Mode, Serial No. Manufacturer, wave length, PN code and the name of the port where it is connected.  Data Center Capacity Management In DCM module our tool fetching the information of total interface counts, connected, and not connected ports counts & also It will show the count of all unused SFPs for all variations like 1G, 10G, 40G and 100G. With this data you can do any type of analytics like total unused SFP, total Connected ports etc IPAM In this module MonetX is fetching data of configured IP on the network devices physical interfaces, VLAN interfaces and Virtual IP like HSRP or VRRP. It is also storing the interface description, vlan name, subnet, Subnets mask and the status of the physical and the admin interface up or down. The benefit of this module is to track any ip from the dashboard & does not need to login to device. in monetX it have capability to add DHCP server as a node and fetch the IP scopes information like Scope name, Lease, used addresses, free addresses etc. and you can manually and  dynamically discover subnets in your environment to get there IP details like where it is configured and which ports are open on that IP address"}, {"question": "Is MonetX is easy to use?", "response": "Yes, also Extravis offers trainings"}, {"question": "Tell me why is MonetX is good for my company?", "response": "With monetX you have manage inventory dynamically and it can give holistic view of your infrastructure"}, {"question": "Is MonetX is cloud based?", "response": "Yes, monetX have both capability cloud and on prem"}, {"question": "If I signup MonetX. Is there specific training required ?", "response": "for Basic features no need for trainings but for advance feature it require 1 day workshop"}, {"question": "Is MonetX is Open Source?", "response": "No its Extravis in house product"}, {"question": "What is MonetX DCM?", "response": "In DCM module our tool fetching the information of total interface counts, connected, and not connected ports counts & also It will show the count of all unused SFPs for all variations like 1G, 10G, 40G and 100G. With this data you can do any type of analytics like total unused SFP, total Connected ports etc"}, {"question": "Is MonetX is mange or integrate multiple vendors?", "response": "yes right now MonetX have capability to integrated with major 13 vendors"}, {"question": "Is MonetX accessible anywhere? or in specific location?", "response": "yes if the deployment is cloud base it can be accessible from anywhere"}, {"question": "How can we access MonetX without VPN?", "response": "For on prem deployment you need VPN but on cloud deployment it can accessed withot VPN"}, {"question": "Can MonetX be used for a small organization?", "response": "Complete MonetX  is developed for big telcos  and enterprise but monitoring and inventory module is suitable for small orgaization"}, {"question": "For what purpose is the IPAM Module used?", "response": "IPAM is used for IPAM management in you infrastructure"}, {"question": "Can I use a specific module from MonetX?", "response": "yes All module have separate Back end, front end and DB it can be used sepratly"}, {"question": "If I am using multiple modules, do I have to upload data for all the modules separately?", "response": "MonetX have both options once you add data in ATOM it can be utalizaed in all modules but it can be uploaded for single module also"}, {"question": "What if I want to shift from one module to multiple modules?", "response": "It is very easy process Support team is available 24/7 "}, {"question": "How many maximum devices does the Model Supports?", "response": "MonetX is tested on 6000 devices "}, {"question": "Can I see status of the devices in the portal?", "response": "yes "}, {"question": "Can I Dismantle the devices that are not in use?", "response": "yes"}, {"question": "Can I Activate a device after Dismantling it?", "response": "yes"}, {"question": "For what purpose is the UAM Module used?", "response": "To deal with rapid technological advancements, businesses often make changes to their network infrastructure, which can create a lot of problems. Manually tracking and compiling data is a time-consuming process that often leads to overlooking devices, entering data incorrectly, and making compilation errors. Therefore, every business needs a network inventory management tool to organize and manage network configurations. When it comes to managing network devices and organizing network assets to track configurations, a network inventory management software is vital. Let's look at the different components that make up holistic network inventory management system: There 2 methods to add device in MonetX 1: Static one be one & 2: Import excel sheet (Atom) which contains list of devices such as IP address, Location, Rack detail, SW type ETC. Once devices are added in Atom with static information. Tool have button to onboard device this algorithm will communicate will devices over the (SSH, APIs, SMNP) and get dynamic information from the devices like status, Serial No, PN code, patch Version, Manufacturer, vendor and HW version along with this our system have capability to fetch information of  boards, sub Boards and SFPs, like if the there is a stack switch it will show the stack members and all information of each stack member. In sub boards our tool is dynamically fetching information power supplies, fan tray, ethernet and SFP module, supervisor engines and route processors. In SFP our tool is fetching information of each SFP like SFP model, Speed, Mode, Serial No. Manufacturer, wave length, PN code and the name of the port where it is connected."}, {"question": "Will the portal provide me access to change the status of devices and their work order?", "response": "yes Admin have rights"}, {"question": "How does the portal access the devices?", "response": "There are multiple ways monitX is using SSH, SNMP, API"}, {"question": "How does the Modules get data of different devices?", "response": "on backend monitX have poller running that will collect the data from devices"}, {"question": "Can I register multiple users on multiple Modules?", "response": "yes on Admin page you can add user and roles"}, {"question": "What of all the failed devices and how they are being managed?", "response": "at the time of on-boarding if devices get fails to onboard it will tell you the reason "}, {"question": "Why are the edit button and check box options are disabled?", "response": "read only users have limited access"}, {"question": "What is difference between export and export template in atom?", "response": "Export template will give you specimen of excel sheet that what data you need to add, and export option will export will data of devices"}, {"question": "How can we add new site name in atom?", "response": "Click on UAM --- Site --- add Sites --- Fill all the details --- Done "}, {"question": "How can we add new rack name?", "response": "Click on UAM --- Rack --- add Rack --- Fill all the details --- Done "}, {"question": "How can we add new password group?", "response": " Atom --- Password Group --- Add password Group --- fill the details --- Done"}, {"question": "How can we add new device type?", "response": "new device type will be added by support team"}, {"question": "How can we assign different password group to same devices", "response": "at the time of filling data just add the password group profile name in password section"}, {"question": "Why are we exporting template in atom?", "response": "Export template will give you specimen of excel sheet that what data you need to add, and export option will export will data of devices"}, {"question": "How can we add new vendors?", "response": "new vendor will be added by support team"}, {"question": "Where atom can be used?", "response": "in all modules"}, {"question": "what is purpose of password group?", "response": "if you have multiple devices with same credentials you just need to attach password group it will work for all devices"}, {"question": "How to add device in monetX?", "response": " adding a Single Device Click Atom --- Add Atom --- Fill out the all required details ---  Add password Group --- Done"}, {"question": "How to add site in monetX?", "response": "Click on UAM --- Site --- add Sites --- Fill all the details --- Done "}, {"question": "How to add racks in monetX?", "response": "Click on UAM --- Rack --- add Sites --- Fill all the details --- Done "}, {"question": "How can we add multiple device for on", "response": "Bulk import Via Excel Sheet  Click Export Template --- Fill the Excel Sheet ---  Import Excel --- Select devices and click on board --- Devices will be onboarded successfully."}, {"question": "What are supported devices in MonetX?", "response": "Cisco, Juniper, Palo-alto, Arista, A10, F5 and many major vendors"}, {"question": "Can I add an unsupported device in monetX?", "response": "but it will be failed on onboard"}, {"question": "My device is in list of supported device but I can't onboard it.", "response": "Contact supports"}, {"question": "What is SFPS?", "response": "Small Form-factor Pluggable is a compact, hot-pluggable network interface module format used for both telecommunication and data communications applications. An SFP interface on networking hardware is a modular slot for a media-specific transceiver, such as for a fiber-optic cable or a copper cable"}, {"question": "DNS Services mean?", "response": "In IPAM montX have ability to add DNS server and it will show its zones and DNS records"}, {"question": "What is DCM?", "response": "Data Center Capacity Management In DCM module our tool fetching the information of total interface counts, connected, and not connected ports counts & also It will show the count of all unused SFPs for all variations like 1G, 10G, 40G and 100G. With this data you can do any type of analytics like total unused SFP, total Connected ports etc"}, {"question": "What is monitoring?", "response": "Network monitoring is the use of a system that constantly monitors a computer network for slow or failing components and that notifies the network administrator in case of outages or other trouble. Network monitoring is part of network management."}, {"question": "What do failed devices display?", "response": "in admin page you can see the failed devices and the reason"}, {"question": "How can a user change their password?", "response": "in Admin module Admin used have rights to change password"}]